app/views/projects/show.html.erb

SELECT COUNT(*) FROM "pledges" WHERE "pledges"."project_id" = ?  [["project_id", 2]]
---
  <p>
    <%= link_to(pluralize(@project.pledges.size, "Pledge"), project_pledges_url(@project)) %>