app/controllers/pledges_controller.rb

	def create
		@pledge = @project.pledges.new(pledge_params)
		if @pledge.save
---
INSERT INTO "pledges" ("amount", "comment", "created_at", "email", "name", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)